<template>
  <v-container id="all_topics">
    <p class="display-1 font-weight-bold">瀏覽專題</p>
    <v-row>
      <v-col
        v-for="topic in topics"
        :key="topic.title"
        cols="12"
        sm="4"
        md="3"
        lg="3"
        xl="2"
      >
        <Topic_card
          :title="topic.title"
          :year="topic.year"
          :description="topic.description"
          :cover="topic.cover"
        />
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
import _ from "lodash";
import Topic_card from "@/components/Topic_card.vue";
export default {
  name: "All",
  components: {
    Topic_card,
  },
  data: () => ({
    topics: [
      {
        title: "零接觸取貨機",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/110/G110B09/G110B09_Data1.png",
        year: 110,
        description:
          "疫情至今尚未緩解，他帶給人們在生活中無數的不便，人們的生活習慣也被迫做出許多改變。人與人間的接觸是感染的最大風險，人們為了減少接觸必會避免外出，轉而選擇網購等方式來採買日常生活用品，而網購在取貨的過程，不管是超商取貨或是郵寄，都不乏會與超商店員或外送員接觸，而現今的郵局的i郵箱是使用觸控螢幕來完成操作，螢幕也會有許多使用者進行操作，在此之中我們就與前一位使用者間接接觸。在需多情況下都充滿直接與間接接觸的機會，這些接觸都有可能讓病毒趁虛而入，減少接觸是勢所必然要做的事。 為了減少接觸，零接觸的商機也因此產生。我們由零接觸及生活中的購物發想，希望能藉這次專題的機會，製作出能在不需接觸機器的情況下完成取貨的機器，可以達到完全零接觸，並為防疫作出貢獻的作品，讓大家更重視零接觸的發展，使其發展更全面讓我們遏止病毒的肆虐，守護健康且不影響生活。",
      },
      {
        title: "星之彩",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/110/G110B08/G110B08_Data1.png",
        year: 110,
        description:
          "遊戲又被稱為第九藝術，我們便想用程式碼創造屬於我們的藝術，近年來推出的優秀作品，諸如From Software的<黑暗靈魂>、Team cherry的<空洞騎士>，以及最近台灣獨立遊戲團隊玻璃心工作室的<守夜人：長夜>，都是我們所參考的對象，我們想用旁人看似冷冰冰的程式碼加上課餘興趣所學的美術，表達我們對遊戲的熱愛以及堅持。",
      },
      {
        title: "腐政",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/109/G109C03/G109C03_Data1.png",
        year: 109,
        description:
          "我們這組希望藉著我們想做遊戲的心，大家能夠更加瞭解過去台灣的歷史大家對於二二八事件的感想頂多就是放假或只是一個過去的歷史，能透過遊戲來讓大家重新想起當年發生的事，是我們這組的目標。我們未來也想試試其他不同的風格，我們不會被同一風格所侷限，也是我們這組的風格，我們想利用製作遊戲讓大家了解這點",
      },
      {
        title: "體感高爾夫 & Motion",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/108/G108A09/G108A09_Data1.jpg",
        year: 108,
        description:
          "在這科技發展快速的年代，遊戲已成為人們生活中不可或缺的休閒活動。我們發現市面上的遊戲皆沒有除了螢幕與聲音以外給予玩家現實生活回饋的機制，我們認為玩家遊玩遊戲的投入感可以透過在適當時間震動等方式增進。但在這遊戲開發資源充足的時代中，開發者沒有一個簡單易用的SDK (Software Development Kit)實作與用戶回饋的機制，同時市面上也沒有經濟實惠的回饋裝置。因此，我們製作了一個SDK提供開發者一個簡單易用、高擴充性的C#函式庫。為了示範及讓開發者了解其開發方法，我們決定製作一個對身體有益同時也可以玩樂的體感高爾夫球遊戲，擊球、獲勝等時刻使用SDK震動自製的Arduino裝置。",
      },
      {
        title: "膽小狗英雄",
        cover: "http://info.taivs.tp.edu.tw/topic/ck/upload/images/146.jpg",
        year: 104,
        description:
          "寵物的存在對於許多人來說無疑是個溫馨的陪伴，但寵物會構成的麻煩也讓許多人退卻，例如現在許多人居住在不得飼養寵物的公寓，也有許多人想養寵物但家人無法接受而退卻。有鑑於以上種種造成無法養寵物理由，我們將推出機器寵物狗，不會構成生活上的麻煩卻溫暖孤單主人的心，對於現在許多孤獨的都市人一定是個吐露心聲與抒發心情的所在！",
      },
      {
        title: "智慧舒肥電鍋",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/110/G110A03/G110A03_Data1.jpg",
        year: 110,
        description:
          "一般在家中想要烹飪這樣的食物需要配合市面上販售的舒肥機才能做出來，但是市售的舒肥機並不便宜，大多三千元起跳，因此我們想要做出更平民的做法，讓沒錢的人也能在家做出高級料理，體驗食物的美味。另外，現在智慧家電流行，我們想把做出來的成品與物聯網做結合，利用手機去遠端操作，讓使用者能更加方便。",
      },
      {
        title: "大安高工平凡日常奪回計畫",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/109/G109A08/G109A08_Data1.png",
        year: 110,
        description:
          "由於我們現在是資訊的高中生,不免俗的非常喜歡打遊戲,但我們也有一個夢想,就是做出屬於自己的遊戲,另外對於近期興起的VR眼鏡也抱持著很大的興趣,並激起我們製作VR遊戲的熱情",
      },
      {
        title: "LINE BOT生活助理",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/108/G108A07/G108A07_Data1.jpg",
        year: 108,
        description:
          "在出門前,總是忘記看天氣預報,又或者怕多久之後又會變天,忘記帶雨傘,多帶一把雨傘都是很麻煩的,因此,我們想到能夠有定時提醒的助理應用程式,能夠在設定之後達到定時提醒天氣,而未來無論是星座.新聞.甚至是交通資訊,都是我們將要努力的目標 ",
      },
      {
        title: "荒謬的大冒險",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/108/G108A04/G108A04_Data1.png",
        year: 108,
        description:
          "因為我們整組都很喜歡玩遊戲，所以我們在想我們不要都只是玩別人做的遊戲，乾脆要不要我們自己也來做一款，於是我們的專題就決定要製作一款我們有辦法做得出來的遊戲。 ",
      },
      {
        title: "The Final Frontier",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/107/G107C04/G107C04_Data1.png",
        year: 107,
        description:
          "在這資訊膨脹的時代裡，電腦效能突飛猛進，越來越多廠商投入遊戲產業，網路上歲處可見到遊戲實況，一款又一款的遊戲不斷問世。其中塔防遊戲是每個人童年都一定玩過，根據地形、武器屬性、敵人屬性和現有的資金，建造一座又一座的防禦塔來抵禦排山倒海而來的敵人。",
      },
      {
        title: "學分大作戰",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/107/G107A01/G107A01_Data1.png",
        year: 107,
        description:
          "想精進英文所遇到的第一個問題，那就是本身的英文字彙量不夠多，只好利用單字課本來努力記下來，這樣卻會讓讀書的效率降低，不但會對英文感到無趣，甚至會有背錯的情形發生，久而久之反而造成反效果，找不到讀書的動力。 ",
      },
      {
        title: "攝影車",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/107/G107B09/G107B09_Data1.png",
        year: 107,
        description:
          "一般在家中想要烹飪這樣的食物需要配合市面上販售的舒肥機才能做出來，但是市售的舒肥機並不便宜，大多三千元起跳，因此我們想要做出更平民的做法，讓沒錢的人也能在家做出高級料理，體驗食物的美味。另外，現在智慧家電流行，我們想把做出來的成品與物聯網做結合，利用手機去遠端操作，讓使用者能更加方便。",
      },
      {
        title: "吉他效果器",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/106/G106C03/G106C03_Data1.jpg",
        year: 106,
        description:
          "在現今科技發達的時代，有許多過去沒有的東西依人們的需求而被發明了出來，其中效果器就是吉他手的福音。能讓聲音變模糊尖銳的破音效果器等都深受吉他手的喜愛，但昂貴的價格卻讓很多人遲遲不敢下手。因此，我們把研究的主題轉向效果器，目的是創造出一台擁有多種效果但要經濟實惠的專題作品，利用儀器運作、硬體架構、邏輯思考等在實習上的各種能力，研究有關效果器的一切並且自製。",
      },
      {
        title: "食在必行",
        cover:
          "http://info.taivs.tp.edu.tw/topic/upload/106/G106A03/G106A03_Data1.jpg",
        year: 106,
        description:
          "食、衣、住、行、育、樂中，由「食」居第一順位，代表著自始至今飲食在人們生活當中都有著舉足輕重的地位。隨著生活型態及消費行為的改變，外食人口也隨之增加，消費者求新求變，造就了餐飲業的蓬勃發展。然而現今餐飲事業的多樣化，使得消費者有更多的選擇。台灣自1993 年起，肥胖人口即逐年增加，並且已經發展到了令人憂心的地步。依據國民健康署「國民健康狀況變遷調查」，我國成年人體重過重加上肥胖率的盛行，由1993到1996年的33％上升至2005到2008年之間的44%。國民健康局在2012年公布的調查更發現，台灣有高達51.1% 的成年男性和35.8% 的成年女性有體重過重的問題。 ",
      },
      {
        title: "綠化回收機",
        cover: "https://i.imgur.com/OkwRY.jpg",
        year: 102,
        description:
          "每個人一生下來就開始製造垃圾，人類每天都不斷地製造大量的垃圾，垃圾的處理是很重要的環保議題，但有許多的垃圾經過特殊處理後便能夠回收再利用，因此將垃圾正確的分類並回收再利用，能夠減少大量的垃圾汙染。首先可回收垃圾中的最大宗便是寶特瓶，許多人總是每天購買一瓶以上飲料，日積月累下來將是相當可觀的數字。根據研究表示製造一個寶特瓶，會生產九三公克的溫室氣體，近年來環保署統計，台灣近四年來寶特瓶增加了3.5萬噸，以國人最常喝的600毫升寶特瓶計算，平均每年能堆疊出三座以上的101大樓，如果其中百分之一的寶特瓶確實回收就會減少約205噸的二氧化碳排放量。可見垃圾回收與分類是人類為維護地球環境的永續經營不可或缺的一環。",
      },
    ],
  }),
  created() {
    this.topics = _.shuffle(this.topics);
  },
};
</script>
